In [1]:
import pandas as pd

In [2]:
import numpy as np

## merging opertions using left,rigth,outer and inner

In [3]:
#there are two parameters here 'on' and 'how'

In [14]:
dic={'name':['siri','chandana','reddy'],'age':[23,22,21],'initial':['tamlamp','gii','hveu']}

In [15]:
dic1={'name':['siri','rash','srav'],'initial':['tamlamp','ee','ef'],'location':['rjy','bangalore','hyderabad']}

In [16]:
df=pd.DataFrame(dic)
df

       name  age  initial
0      siri   23  tamlamp
1  chandana   22      gii
2     reddy   21     hveu

In [17]:
df1=pd.DataFrame(dic1)
df1

   name  initial   location
0  siri  tamlamp        rjy
1  rash       ee  bangalore
2  srav       ef  hyderabad

In [22]:
d=pd.merge(df,df1,on=['name','initial'],how='outer')  #prints all columns and all rows
d

       name   age  initial   location
0      siri  23.0  tamlamp        rjy
1  chandana  22.0      gii        NaN
2     reddy  21.0     hveu        NaN
3      rash   NaN       ee  bangalore
4      srav   NaN       ef  hyderabad

In [23]:
d=pd.merge(df,df1,on=['name','initial'],how='inner')  #print common rows with all columns having name and intial same

In [24]:
d

   name  age  initial location
0  siri   23  tamlamp      rjy

In [25]:
d=pd.merge(df,df1,on=['name','initial'],how='left')  #print common rows with all columns having name and intial same with left table

In [26]:
d

       name  age  initial location
0      siri   23  tamlamp      rjy
1  chandana   22      gii      NaN
2     reddy   21     hveu      NaN

In [27]:
d=pd.merge(df,df1,on=['name','initial'],how='right')  #print common rows with all columns having name and intial samewith right table

In [28]:
d

   name   age  initial   location
0  siri  23.0  tamlamp        rjy
1  rash   NaN       ee  bangalore
2  srav   NaN       ef  hyderabad